app/controllers/agreements_controller.rb

SELECT "agreements".* FROM "agreements"
SELECT DISTINCT "agreements"."category" FROM "agreements"  ORDER BY "agreements"."category" ASC
---
  def index
    @agreements = Agreement.all
    @user = current_user

    if params[:category] == nil
			@agreements = Agreement.all
    else
			@agreements = Agreement.where(category: params[:category].titleize)
    end
    #alphabetical
		@my_categoryes = Agreement.select(:category).order(:category).distinct

SELECT DISTINCT "agreements"."category" FROM "agreements"  ORDER BY "agreements"."category" ASC
---
  def new
    @agreement = Agreement.new

		if params[:category] == nil
			@agreements = Agreement.all
    else
			@agreements = Agreement.where(category: params[:category].titleize)
    end
    #alphabetical
		@my_categoryes = Agreement.select(:category).order(:category).distinct

SELECT  "agreements".* FROM "agreements" WHERE "agreements"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_agreement
      @agreement = Agreement.find(params[:id])