app/controllers/users_controller.rb

SELECT DISTINCT "agreements"."category" FROM "agreements"  ORDER BY "agreements"."category" ASC
---
  def new
    @user = User.new

		if params[:category] == nil
			@agreements = Agreement.all
    else
			@agreements = Agreement.where(category: params[:category].titleize)
    end
    #alphabetical
		@my_categoryes = Agreement.select(:category).order(:category).distinct